app/Controllers/Auth.php

    public function loginSubmit()
    {
        $session = session();
        $usersModel = new UserModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $usersModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'dnmercado@fit.edu.ph'
 LIMIT 1