app/Controllers/Equipment.php

    public function add()
    {
        $typeModel = new EquipmentTypeModel();

        $types = $typeModel->findAll();
        $db = \Config\Database::connect();

        foreach ($types as &$type) {
            $query = $db->table('type_accessories')
                        ->select('GROUP_CONCAT(accessory_name SEPARATOR ", ") as accessory_name', false)
                        ->where('type_id', $type['type_id'])
                        ->get();
---
SELECT *
FROM `equipment_types`
SELECT GROUP_CONCAT(accessory_name SEPARATOR ", ") as accessory_name
FROM `type_accessories`
WHERE `type_id` = '1'

    public function edit($id)
    {
        $assetModel = new EquipmentAssetModel();
        $typeModel  = new EquipmentTypeModel();
        $db = \Config\Database::connect();

        $item = $assetModel->find($id);

        $types = $typeModel->findAll();
        foreach ($types as &$type) {
            $query = $db->table('type_accessories')
                        ->select('GROUP_CONCAT(accessory_name SEPARATOR ", ") as accessory_name', false)
                        ->where('type_id', $type['type_id'])
                        ->get();
---
SELECT *
FROM `equipment_types`
SELECT GROUP_CONCAT(accessory_name SEPARATOR ", ") as accessory_name
FROM `type_accessories`
WHERE `type_id` = '1'