app/Controllers/Transaction.php

    public function borrow()
    {
        $userModel = new UserModel();
        $equipmentTypeModel = new EquipmentTypeModel();

        $data = [
            'users' => $userModel->select('school_id, first_name, last_name')->findAll(),
            'equipment_types' => $equipmentTypeModel->select('type_id, name, available_quantity')->findAll(),
            'title' => 'New Equipment Borrowing'
        ];
---
SELECT `school_id`, `first_name`, `last_name`
FROM `users`
SELECT `type_id`, `name`, `available_quantity`
FROM `equipment_types`