app/Controllers/Users.php

    public function index($perpage = 5)
    {
        $usersModel = new UserModel();

        $search = $this->request->getGet('search');
        if (!empty($search)) {
            $usersModel->groupStart()
                ->like('first_name', $search)
                ->orLike('last_name', $search)
                ->orLike('school_id', $search)
            ->groupEnd();
        }

        $usersModel->orderBy('created_at', 'DESC');

        $data = [
            'title' => 'User Management',
            'users' => $usersModel->paginate($perpage),
            'pager' => $usersModel->pager,
            'search' => $search
        ];
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`