app/Models/TransactionModel.php

    public function getHistory()
    {
        return $this->select('transactions.*,
                              users.first_name, users.last_name,
                              equipment_assets.property_tag, equipment_types.name as item_name')
                    ->join('users', 'users.school_id = transactions.borrower_id')
                    ->join('equipment_assets', 'equipment_assets.property_tag = transactions.item_tag')
                    ->join('equipment_types', 'equipment_types.type_id = equipment_assets.type_id')
                    ->orderBy('borrowed_at', 'DESC')
                    ->findAll();
---
SELECT `transactions`.*, `equipment_assets`.`property_tag`, `equipment_types`.`name` as `item_name`, `equipment_types`.`image`
FROM `transactions`
JOIN `equipment_assets` ON `equipment_assets`.`property_tag` = `transactions`.`item_tag`
JOIN `equipment_types` ON `equipment_types`.`type_id` = `equipment_assets`.`type_id`
WHERE `transactions`.`borrower_id` = '87654321'
ORDER BY `transactions`.`borrowed_at` DESC